acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_ЖурналСобытий/Аид_ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аид_ЖурналСобытий</name>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.Аид_ТипыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусСобытия</name>
    <comment>//Истина - без ошибок, Ложь - с ошибками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусДоставки</name>
    <comment>//Истина - без ошибок, Ложь - с ошибками</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибкиДоставки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстДиалога</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйКлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

acc1072.АвтоматизацияИнформированияДебиторов/src/Enums/Аид_ТипыСообщений/Аид_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Аид_ТипыСообщений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>ГолосовоеСообщение</name>
  </enumValues>
</mdclass:Enum>

acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_ЖурналСобытий/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мДатаСобытия = Дата(1,1,1);
	
	Если Параметры.Свойство("ДатаСобытия", мДатаСобытия) и ЗначениеЗаполнено(мДатаСобытия) тогда
		
		ГруппаДатаСобытия = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "Дата события", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатаСобытия,
			"ДатаВремяСобытия",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			КонецДня(мДатаСобытия),
			, ЗначениеЗаполнено(мДатаСобытия));
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатаСобытия,
			"ДатаВремяСобытия",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			НачалоДня(мДатаСобытия),
			, ЗначениеЗаполнено(мДатаСобытия));	
		
	КонецЕсли;
		
	Если Параметры.Свойство("ТипСообщения") тогда
				
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипСообщения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Параметры.ТипСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусДоставки(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СтатусСобытия = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение не было отправлено!");
		Возврат;	
	КонецЕсли;
	
	ОбновитьСтатусДоставкиНаСервере(ТекущиеДанные.УникальныйКлючЗаписи, ТекущиеДанные.ТипСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусДоставкиНаСервере(ИдентификаторСообщения, ТипСообщения)
	
	Если ТипСообщения = Перечисления.Аид_ТипыСообщений.ГолосовоеСообщение Тогда 
		Аид_ОтправкаГолосовойПочты.СтатусДоставки(ИдентификаторСообщения);
	ИначеЕсли ТипСообщения = Перечисления.Аид_ТипыСообщений.SMS Тогда
		Аид_ОтправкаSMS.СтатусДоставки(ИдентификаторСообщения);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ФормаИзменить.Видимость = Ложь;
	//Элементы.ФормаСкопировать.Видимость = Ложь;
	//Элементы.ФормаСоздать.Видимость = Ложь;
	//Элементы.ФормаУдалить.Видимость = Ложь;

КонецПроцедуры
